# -*- coding:utf-8 -*-
# @Time : 2022/7/29 4:07 下午
# @Author : Bin Bin Xue
# @File : chart2_Python数据分析与挖掘基础
# @Project : data_mining

'''
第二章 Python数据分析与挖掘基础

    2.1 Python程序概述
            基础数据类型、变量和赋值、运算符和表达式、字符串、流程控制、函数
    2.2 内建数据结构
            列表、元组、字典、集合
    2.3 Numpy数值运算基础
            创建数组、方法和属性、生成随机数、数组变换、索引和切片、数组运算、统计分析
    2.4 Pandas统计分析基础
            数据结构、索引对象、查看属性、数据查询与编辑、数据运算（会自动对齐，缺的结果为空）
            、函数应用与映射、排序、汇总与统计、分组与聚合、数据读取与存储
    2.5 Matplotlib图表绘制基础
            简介、绘图基础、设置pyplot的动态参数、文本注解、常用绘图
    2.6 scikit-learn
            1_主要功能：
                            数据预处理（数据清理、数据集成、数据规约、数据变换）
                            数据降维（PCA和NMF）
                            回归（预测数值型的目标值）
                            分类（给对象指定所属类别）
                            聚类（无监督学习，按相似度分组）
                            模型选择（参数、模型的比较和验证，入交叉验证）

            2_数据集：(数据量较小，无法代表真实世界中的机器学习任务）
                            鸢尾花_load_iris()_多分类任务
                            波士顿_load_boston()_回归任务
                            乳腺癌_load_breast_cancer()_二分类任务
                            体能训练_load_linnerud()_多分类任务
                            酒_load_wine()_分类任务

'''