# -*- coding:utf-8 -*-
# @Time : 2022/7/29 2:14 下午
# @Author : Bin Bin Xue
# @File : chart1_绪论
# @Project : data_mining

'''
第一章 绪论

    1.1 数据挖掘简介
        知识发现(kdd)
            =数据准备+数据挖掘+结果表达与解释

    1.2 数据分析与数据挖掘
                                    数据分析                                数据挖掘
        侧重点     将现有技术用于实际的业务             研究挖掘技术
        技能点   统计学/数据库/Excel和可视化等       数学/编程技术
          结果     需结合业务知识解读统计结果             模型或规则

    1.3 数据挖掘的主要任务
        1_关联分析 - 变量之间的关系，找出隐藏的关联网
        2_数据建模预测 - 分类和回归，两者预测目标不同，但都是训练一个模型，
                                     使预测值与实际值之间的误差最小
        3_聚类分析 - 把数据按照相似性归纳成不同类别
        4_离群点检测 - 异常值检测、分析和处理

    1.4 数据挖掘的数据源
        数据库、数据仓库、事务型数据库等

    1.5 数据挖掘使用的技术
        统计学、机器学习、数据库管理系统和数据仓库等

    1.6 数据挖掘存在的主要问题
        多模态、噪声数据、高维、挖掘规律的可解释性

    1.7 数据挖掘建模的常用工具
        商用：SAS Enterprise Miner/IBM SPSS Modeler/IBM Interlligent Miner
        开源：R语言/Python/WEKA/RapidMiner

    1.8 为何使用Python进行数据挖掘
        爬虫库/数据分析库/语法简单

    1.9 python数据挖掘常用库
        ...+Keras(深度学习库)+Gensim(语义库)

    1.10 Jupyter

'''