# -*- coding:utf-8 -*-
# @Time : 2022/7/29 8:19 下午
# @Author : Bin Bin Xue
# @File : chart9_神经网络与深度学习
# @Project : data_mining

'''
第九章 神经网络与深度学习
    9.1 神经网络基础
        ...
    9.2 BP神经网络
        BP-后向传播算法
        思想：多层前馈神经网络+2阶段（正向传播、反向传播）+梯度下降（误差最小）



    9.3 深度学习
        常用的深度学习算法：卷积神经网络（CNN）、循环神经网络（RNN）、生成对抗网络(GAN)
        1_CNN
          针对二维数据设计
          五层结构：输入层、卷积层、池化层、全连接层、输出层
        2_RNN
          神经元输出可以指向自己，实现迭代循环
          在时间序列相关场景中效果更明显
        3_GAN
          生成模型+判别模型（前者生成新的数据，后者对样本进行分类）


'''